{
  "INIT_PROJECT_TOKENIZER": {
    "title": "Tokenizer for Text Attributes",
    "text": "For Information Extraction tasks we need to tokenize your text data. For that we provide a selection of pre-built SpaCy tokenizers in many different languages. Please select the language that your text data will have. If there is no text data in your use-case, then just leave everything as it is and skip this step!",
    "href": "https://spacy.io/models/en",
    "hrefCaption": "Open in SpaCy documentation"
  },
  "SETTINGS_ATTRIBUTES": {
    "title": "Record Attributes",
    "text": "If you have trouble uploading data please look into our documentation that is linked at the very bottom of this tooltip! Once you uploaded some data, this is the card where all attributes and their inferred data type are listed. Feel free to adjust the types if necessary. Please also select the primary key (can be multiple attributes) which is required to detect duplicates. If you add labeling tasks in this card, you will get a labeling task on that specific attribute (e.g. Information Extraction of news but only on the headline).",
    "href": "https://onetask.readme.io/v0.2/docs/setup#-uploading-data",
    "hrefCaption": "Learn more about uploading data"
  },
  "SETTINGS_EMBEDDINGS": {
    "title": "Embeddings",
    "text": "Embeddings are a requirement for our active learners. When you are adding an embedding, you must select an attribute (should be of type text) and either select one of our recommended embedders or input a valid huggingface model handle (e.g. distilbert-base-german-cased).",
    "href": "https://onetask.readme.io/v0.2/docs/setup#%EF%B8%8F-creating-embeddings",
    "hrefCaption": "Learn more about Embeddings in onetask"
  },
  "SETTINGS_LABELING_TASKS": {
    "title": "Labeling Tasks",
    "text": "Add labeling tasks here if you want to label whole records (e.g. label a whole e-mail as spam or non-spam).",
    "href": "https://onetask.readme.io/v0.2/docs/setup#%EF%B8%8F-creating-labeling-tasks",
    "hrefCaption": "Learn more about Labeling Tasks"
  },
  "KNOWLEDGE_BASE_OVERVIEW": {
    "title": "Knowledge Bases",
    "text": "Knowledge Bases are useful collections of terms that you can use in your Labeling Functions. They are created automatically for every Information Extraction Label. If you somehow want to create a Knowledge Base yourself and fill it manually, you can do so here. Inspect the details of a Knowledge Base to learn more about it!",
    "href": "https://onetask.readme.io/v0.2/docs/knowledge-bases",
    "hrefCaption": "How to use Knowledge Bases in onetask"
  },
  "KNOWLEDGE_BASE_DETAILS_BLACKLIST": {
    "title": "Knowledge Base Blacklist",
    "text": "Blacklisting terms in a knowledge base is useful if you want to exclude certain terms in your labeling function, but don't want to delete the associated label where the term originated from.",
    "href": "https://onetask.readme.io/v0.2/docs/workflow#%F0%9F%A7%AE-knowledge-bases",
    "hrefCaption": "Where blacklisting terms makes sense"
  },
  "INFORMATION_SOURCES_CALCULATE_LABELS": {
    "title": "Weak Supervision",
    "text": "Here you can calculate your weak supervision labels - make sure to first select all the Information Sources that should contribute to the weak supervision label! To learn more about the Information Sources themselves, add a few and head into their details!",
    "href": "https://onetask.readme.io/v0.2/docs/information-integration#-weak-supervision",
    "hrefCaption": "Weak Supervision in onetask"
  },
  "INFORMATION_SOURCES_DETAILS_TARGET_TASK": {
    "title": "Target Task",
    "text": "Here you have to specify the Labeling Task that this particular Information Source is targeting. For example if you want this Information Source to help in labeling your e-mails, then select the Labeling Task that was created for just that!",
    "href": "https://onetask.readme.io/v0.2/docs/labeling-functions",
    "hrefCaption": "Examples of Labeling Functions"
  },
  "INFORMATION_SOURCES_DETAILS_FUNCTION_LOG": {
    "title": "Function Log",
    "text": "We run Information Sources in separated environments. This output gives you a little insight into that blackbox! Pro tip: print out information that is important to you and it will be persisted in these logs! You can access previous runs and their logs just beneath the calculated statistics.",
    "href": "https://onetask.readme.io/v0.2/docs/labeling-functions",
    "hrefCaption": "Examples of Labeling Functions"
  },
  "INFORMATION_SOURCES_DETAILS_STATISTICS": {
    "title": "Statistics",
    "text": "It is very important to validate your Information Sources! True and False Positives are calculated on your manually labeled SCALE data. If you want to validate your Information Source, head over to the Data Browser, filter by the records that got hit by your Information Source and start a labeling session with just those!",
    "href": "https://onetask.readme.io/v0.2/docs/information-integration",
    "hrefCaption": "Validating Information Sources"
  },
  "OVERVIEW_MONITORING": {
    "title": "Monitoring",
    "text": "The Confusion Matrix and Label Distribution are seperately calculated for every Labeling Task. Please select the Labeling Task you are interested in and the charts will update accordingly!",
    "href": "https://onetask.readme.io/v0.2/docs/monitoring",
    "hrefCaption": "Using the Monitoring Charts in onetask"
  },
  "CREATE_PROJECT": {
    "title": "Project Creation",
    "text": "You can either create a new and empty project or upload a previously exported project.",
    "href": "https://onetask.readme.io/v0.2/docs/setup#-creating-projects",
    "hrefCaption": "Creating a Project"
  },
  "INFORMATION_SOURCES_DETAILS_RUN": {
    "title": "Running Constraints",
    "text": "The run button will be disabled as long as there is a running instance of that information source. However, should there be an unexpected bug and the previous run does not finish, the button will be re-enabled after 10 minutes for another try.",
    "href": "",
    "hrefCaption": ""
  }
}
